app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();